Repository: Aman-parashar/Coptic-Match
Catalog: HalalDating/Localizable/*.lproj/Localizable.strings
Languages: ar

source: No data found
ar: لاتوجد بيانات

source: No internet connection
ar: لا يوجد اتصال بالإنترنت

source: Not detect internet
ar: عدم الكشف عن الإنترنت

source: Something went wrong. please try again
ar: هناك خطأ ما. حاول مرة اخرى.

source: Search
ar: يبحث

source: Type a message...
ar: ...اكتب رسالة

source: Chat
ar: دردشة

source: Profile
ar: الملف الشخصي

source: Edit profile
ar: تعديل الملف الشخصي

source: User name
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Continue with Google
ar: تسجيل الدخول باستخدام جوجل

source: Continue with Facebook
ar: تسجيل الدخول باستخدام فيسبوك

source: Continue with Apple
ar: تواصل مع أبل

source: By continuing you agree to the
ar: من خلال الاستمرار فإنك توافق على

source: Terms
ar: شروط

source: and
ar: و

source: Privacy Policy
ar: سياسة الخصوصية

source: Please enter valid email address
ar: الرجاء إدخال عنوان بريد إلكتروني صالح

source: Enter your phone number
ar: أدخل رقم هاتفك

source: Phone number
ar: رقم الهاتف

source: Please enter valid phone number
ar: الرجاء إدخال رقم هاتف صحيح

source: Please try again.
ar: حاول مرة اخرى.

source: Add Email
ar: أضف بريدًا إلكترونيًا

source: Cancel
ar: يلغي

source: Enter otp
ar: otp أدخل

source: Next
ar: التالي

source: NEXT
ar: التالي

source: Today
ar: اليوم

source: Yesterday
ar: في الامس

source: Do you want to Logout ?
ar: هل ترغب بالخروج ؟

source: No
ar: رقم

source: Yes
ar: نعم

source: Logout Alert !
ar: تنبيه الخروج!

source: Likes
ar: الإعجابات

source: Continue
ar: متابعة

source: Add your best photos
ar: أضف أفضل صورك

source: Signin with phone number
ar: تسجيل الدخول باستخدام رقم الهاتف

source: Home
ar: مسكن

source: Male
ar: ذكر

source: Female
ar: أنثى

source: All
ar: الجميع

source: Distance
ar: المسافة

source: Gender
ar: نوعك

source: Age
ar: العمر

source: Notification
ar: إشعارات

source: Filter
ar: عوامل التصفية

source: Photos
ar: الصور

source: Log out
ar: تسجيل خروج

source: #1 Marriage App For Muslims 🥇
ar: التطبيق رقم ١ لزواج المسلمين 🥇

source: Verification code
ar: رمز التحقق

source: Please enter the 4-digit code sent by SMS to
ar: الرجاء إدخال الرمز المكون من 4 أرقام المرسل عبر رسالة نصية قصيرة إلى

source: Didn't receive a verification code?
ar: لم تستلم رمز التحقق؟

source: Resend the code
ar: أعد إرسال الرمز

source: Welcome To HalalDating!
ar: مرحبا بكم في HalalDating!

source: Be Honest
ar: كن صادقا

source: HalalDating Only For Those Seriously Looking For Marriage
ar: HalalDating فقط لأولئك الذين يبحثون بجدية عن الزواج

source: Be Respectful
ar: كن محترما

source: Our Mission
ar: مهمتنا

source: You're here to find real love so please be respectful to others.
ar: أنت هنا لتجد الحب الحقيقي ، لذا من فضلك كن محترمًا للآخرين.

source: Our support team will manually review every user profile and do our best to eliminate scammers and fake profiles. You will have the highest chance to find your ideal match here.
ar: سيقوم فريق الدعم لدينا بمراجعة ملف تعريف كل مستخدم يدويًا وبذل قصارى جهدنا للقضاء على المحتالين والملفات الشخصية المزيفة. سيكون لديك أكبر فرصة للعثور على الشريك المثالي هنا.

source: I accept
ar: وافقت

source: What's your name?
ar: ما اسمك؟

source: Your nick name and don't share your last name
ar: الرجاء الاختيار بعناية لن تتمكن من تحرير هذه المعلومات لاحقًا.

source: What is your date of birth?
ar: ما هو تاريخ ميلادك؟

source: You must be at least 18 years old to use this app.
ar: يجب أن يكون عمرك 18 عامًا على الأقل لاستخدام هذا التطبيق.

source: I am a
ar: ما هو جنسك؟

source: Man
ar: ذكر

source: Woman
ar: انثى

source: Please choose carefully you will not be able to edit this information later.
ar: الرجاء الاختيار بعناية لن تتمكن من تحرير هذه المعلومات لاحقًا.

source: What is your relationship status?
ar: ما هى حالتك الاجتماعية؟

source: Never married
ar: لم يسبق الزواج

source: Married
ar: متزوج

source: Separated
ar: منفصل

source: Divorced
ar: مطلق

source: Widowed
ar: ارمل

source: Single
ar: أعزب

source: Do you have kids?
ar: هل لديك اطفال؟

source: Have kids
ar: نعم

source: Don't have kids
ar: ليس لديهم اطفال

source: What is your education?
ar: ما هو مستواك التعليمى؟

source: High School
ar: مدرسة ثانوية

source: Bachelors
ar: غير حاصل على شهادة

source: Masters
ar: درجة جامعية

source: Post graduate
ar: دراسات عليا

source: Prefer not to say
ar: افضل عدم القول

source: What is your height?
ar: كم هو طولك؟

source: 4'0'' (122 cm)
ar: 0'4 (122 سم)

source: 4'1'' (125 cm)
ar: 1'4 (125 سم)

source: 4'2'' (127 cm)
ar: 2'4 (127 سم)

source: 4'3'' (130 cm)
ar: 3'4 (130 سم)

source: 4'4'' (132 cm)
ar: 4'4 (132 سم)

source: 4'5'' (135 cm)
ar: 5'4 (135 سم)

source: 4'6'' (137 cm)
ar: 6'4 (137 سم)

source: 4'7'' (140 cm)
ar: 7'4 (140 سم)

source: 4'8'' (142 cm)
ar: 8'4 (142 سم)

source: 4'9'' (145 cm)
ar: 9'4 (145 سم)

source: 4'10'' (147 cm)
ar: 10'4 (147 سم)

source: 4'11'' (150 cm)
ar: 11'4 (150 سم)

source: 4'12'' (152 cm)
ar: 12'4 (152 سم)

source: 5'0'' (153 cm)
ar: 0'5 (153 سم)

source: 5'1'' (155 cm)
ar: 1'5 (155 سم)

source: 5'2'' (157 cm)
ar: 2'5 (157 سم)

source: 5'3'' (160 cm)
ar: 3'5 (160 سم)

source: 5'4'' (162 cm)
ar: 4'5 (162 سم)

source: 5'5'' (165 cm)
ar: 5'5 (165 سم)

source: 5'6'' (167 cm)
ar: 6'5 (167 سم)

source: 5'7'' (170 cm)
ar: 7'5 (170 سم)

source: 5'8'' (172 cm)
ar: 8'5 (172 سم)

source: 5'9'' (175 cm)
ar: 9'5 (175 سم)

source: 5'10'' (177 cm)
ar: 10'5 (177 سم)

source: 5'11'' (180 cm)
ar: 11'5 (180 سم)

source: 5'12'' (182 cm)
ar: 12'5 (182 سم)

source: 6'0'' (183 cm)
ar: 0'6 (183 سم)

source: 6'1'' (186 cm)
ar: 1'6 (186 سم)

source: 6'2'' (188 cm)
ar: 2'6 (188 سم)

source: 6'3'' (190 cm)
ar: 3'6 (190 سم)

source: 6'4'' (193 cm)
ar: 4'6 (193 سم)

source: 6'5'' (195 cm)
ar: 5'6 (195 سم)

source: 6'6'' (198 cm)
ar: 6'6 (198 سم)

source: 6'7'' (200 cm)
ar: 7'6 (200 سم)

source: 6'8'' (202 cm)
ar: 8'6 (202 سم)

source: 6'9'' (205 cm)
ar: 9'6 (205 سم)

source: 6'10'' (207 cm)
ar: 10'6 (207 سم)

source: 6'11'' (210 cm)
ar: 11'6 بوصة (210 سم)

source: 6'12'' (212 cm)
ar: 12'6 (212 سم)

source: What you looking for?
ar: ماذا تبحث عن؟

source: Friends
ar: اصدقاء

source: Marriage
ar: الزواج

source: Do you work out?
ar: هل تمارس الرياضة؟

source: Active
ar: نعم

source: Sometimes
ar: بعض الاحيان

source: Almost never
ar: على الاغلب ل

source: German
ar: ألمانية

source: English
ar: إنجليزي

source: Spanish
ar: الأسبانية

source: French
ar: فرنسي

source: Indonesian
ar: الأندونيسية

source: Malay
ar: لغة الملايو

source: Dutch
ar: هولندي

source: Urdu
ar: الأردية

source: Hindi
ar: هندي

source: Select your language
ar: ماهى اللغة الذى تتحدثها؟

source: How religious are you?
ar: ما مدى تدينك؟

source: Not Practising
ar: لا امارس

source: Moderately practising
ar: متدين

source: Practising
ar: امارس

source: Very practising
ar: اصلى احيانا

source: Never pray
ar: لا اصلى

source: Sometimes pray
ar: بعض الاحيان اصلى

source: Usually pray
ar: عادة اصلى

source: Always pray
ar: دائما اصلى

source: How often do you pray?
ar: كم مرة تصلى؟

source: Do you only eat halal?
ar: هل تاكل الحلال فقط؟

source: Do you smoke?
ar: هل تدخن؟

source: Do you drink alcohol?
ar: هل تشرب الخمر؟

source: When are you looking to get married?
ar: متى تريد الزواج؟

source: Marriage within a year
ar: الزواج خلال عام

source: Marriage in 1-2 Years
ar: الزواج خلال 1-2 اعوام

source: Marriage in 3-4 Years
ar: الزواج خلال 3-4 اعوام

source: Marriage in 4+ Years
ar: الزواج خلال اكثر من 4 اعوام

source: Don’t know yet
ar: لا أعرف بعد

source: Please upload at least two real pictures of you
ar: يرجى تحميل صورتين حقيقيتين على الأقل لك

source: Main
ar: رئيسي

source: Take a selfie
ar: خذ صورة شخصية

source: Please take a quick selfie to confirm you're a real person. Your selfie won't appear on your profile and will not be seen by our team.
ar: يرجى التقاط صورة ذاتية سريعة لتأكيد أنك شخص حقيقي. لن تظهر صورتك الذاتية في ملفك الشخصي ولن يراها فريقنا.

source: Show your face clearly
ar: أظهر وجهك بوضوح

source: Make sure you're in a well it area and have both eyes clearly visible.
ar: تأكد من أنك في منطقة جيدة وأن تكون كلتا العينين مرئية بوضوح.

source: Verify person
ar: تحقق من هويتى

source: Submit
ar: متابعة

source: Retake
ar: إعادة

source: Selfie
ar: سيلفي

source: We're reviewing your profile.
ar: نحن نراجع ملفك الشخصي.

source: We're reviewing your profile, try later...
ar: نحن نراجع ملفك الشخصي ، حاول لاحقًا ...

source: Once approved we'll make your profile public for other amazing muslims to discover.
ar: بمجرد الموافقة ، سنجعل ملفك الشخصي عامًا حتى يكتشفه المسلمون الرائعون الآخرون.

source: DONE
ar: فعله

source: Gold member Features
ar: ميزات الأعضاء الذهبية

source: Premium member Features
ar: ميزات الأعضاء المتميزين

source: Change your mind
ar: غير رأيك

source: See who likes you
ar: انظر من يحبك

source: Chat without limit
ar: الدردشة بلا حدود

source: Increase your matches
ar: زيادة المباريات الخاصة بك

source: Like without limit
ar: مثل بلا حدود

source: Change any swipe and unlock
ar: تغيير أي انتقاد وفتح

source: Profile Boost
ar: تعزيز الملف الشخصي<

source: Get profile boost and seen by 30x more people
ar: احصل على تعزيز للملف الشخصي وشاهده عدد أكبر من الأشخاص بمقدار 30 ضعفًا

source: Become a Gold member
ar: كن عضوا ذهبيا

source: Payment Success
ar: الدفع الناجح

source: Close
ar: قريب

source: Up to 100km away
ar: ما يصل إلى 001 كم

source: Between
ar: بين

source: to
ar: إلى

source: Update
ar: تحديث

source: About me
ar: معلومات عنى

source: My lifestyle
ar: أسلوب حياتي

source: Marriage goals
ar: أهداف الزواج

source: SEE WHO LIKES YOU
ar: اكتشف من معجب بك

source: Liked you
ar: احبك

source: People have liked you will appear here. Get swiping to increase your changes!
ar: سيظهر لك الناس هنا. احصل على الضرب لزيادة التغييرات الخاصة بك!

source: You
ar: أنت

source: Send a message
ar: ارسل رسالة

source: Messages
ar: دردشاتك

source: Matches
ar: المتوافقون الجدد

source: Block
ar: حظر

source: Report
ar: تقرير

source: Are you sure?
ar: هل أنت واثق؟

source: What would you like report?
ar: ماذا تريد التقرير؟

source: Report account
ar: الإبلاغ عن الحساب

source: Please select a problem to report
ar: الرجاء تحديد مشكلة للإبلاغ عنها

source: Hate speech
ar: خطاب الكراهية

source: Scam
ar: احتيال

source: Violence
ar: هنف

source: Spam
ar: رسائل إلكترونية مزعجة

source: I just don't like it
ar: أنا فقط لا أحب ذلك

source: It's posting content that shouldn't be on HalalDating
ar: إنه ينشر محتوى لا ينبغي أن يكون على HalalDating

source: It's pretending to be someone else
ar: إنه يتظاهر بأنه شخص آخر

source: The may be under the age of 13
ar: قد يكون عمره أقل من 13 عامًا

source: Thanks for letting us know
ar: شكرا لإعلامنا

source: Profile preview
ar: معاينة الملف الشخصي

source: Share your story ❤️ win your 🎁
ar: شارك قصتك ❤️ اكسب 🎁

source: Setting
ar: الاعدادات

source: Safety tips
ar: ارشادات الأمان

source: Basic info
ar: معلومات أساسية

source: Name
ar: اسمك

source: Date of Birth
ar: تاريخ الميلاد

source: Education
ar: التعليم

source: Language
ar: اللغة

source: Islamic lifestyle
ar: أسلوب حياة إسلامي

source: Religiosity
ar: التدين

source: Praying
ar: الصلاة

source: Halal food
ar: الطعام الحلال

source: Alcohol
ar: شرب الكحول

source: Smoke
ar: التدخين

source: More about me
ar: المزيد عن

source: Height
ar: الطول

source: Marital status
ar: الحالة الزوجية

source: Kids
ar: أطفال

source: Marriage plan
ar: خطة الزواج

source: Workout
ar: الرياضة

source: Subscription
ar: الاشتراك

source: Terms & Conditions
ar: البنود و الظروف

source: Delete Account
ar: حذف الحساب

source: My Subscription
ar: اشتراكي

source: Plan name
ar: اسم الخطة

source: Status
ar: حالة

source: Payment mode
ar: طريقة الدفع

source: Date of purchase
ar: تاريخ الشراء

source: Expiry date
ar: تاريخ انتهاء الصلاحية

source: Please let us know why you're leaving us.
ar: يرجى إخبارنا بسبب مغادرتك لنا.

source: We are always looking for improve and welcome your honest feedback.
ar: نحن نبحث دائمًا عن التحسين ونرحب بتعليقاتك الصادقة.

source: I met a partner on HalalDating
ar: التقيت بشريك في HalalDating

source: I met a partner elsewhere
ar: التقيت بشريك في مكان آخر

source: I want to take a break
ar: أريد أن آخذ استراحة

source: I did't like HalalDating
ar: لم يعجبني HalalDating

source: Other
ar: آخر

source: Type here..
ar: أكتب هنا..

source: Code
ar: البلد

source: Like Without Limit
ar: اعجاب بلا حدود

source: Recurring billing, cancel anytime
ar: الفواتير المتكررة ، يمكنك الإلغاء في أي وقت.

source: By tapping Continue, your payment will be charged to your account, and your subscription will automatically renew for the same package length at the same price until you cancel in your Account Settings at least 24 hour prior to the auto-renewal may be turned off by going to the user's Account Settings after purchase. By tapping Continue, you agree to our
ar: من خلال النقر فوق متابعة ، سيتم خصم دفعتك من حسابك ، وسيتم تجديد اشتراكك تلقائيًا بنفس طول الحزمة بنفس السعر حتى تقوم بالإلغاء في إعدادات الحساب الخاصة بك قبل 24 ساعة على الأقل من التجديد التلقائي قد يتم إيقاف تشغيله بواسطة الذهاب إلى إعدادات حساب المستخدم بعد الشراء. بالنقر فوق متابعة ، فإنك توافق على

source: Chat Info
ar: معلومات الدردشة

source: Add Users to Chat
ar: أضف مستخدمين إلى الدردشة

source: Leave Chat
ar: اترك الدردشة

source: Delete Chat
ar: حذف الدردشة

source: Delete
ar: حذف

source: App Info
ar: معلومات التطبيق

source: Create
ar: خلق

source: Done
ar: فعله

source: Finish
ar: إنهاء

source: Send
ar: إرسال

source: Save attachment
ar: احفظ المرفق

source: Forward
ar: إلى الأمام

source: Delivered to...
ar: ...سلمت ل

source: Viewed by...
ar: ...شاهده

source: Save File
ar: احفظ الملف

source: Login to Chat error. Please relogin.
ar: خطأ في تسجيل الدخول إلى الدردشة. الرجاء إعادة تسجيل الدخول.

source: Please enter your login and username
ar: الرجاء إدخال معلومات تسجيل الدخول الخاصة بك واسم المستخدم

source: Login
ar: تسجيل الدخول

source: Username
ar: اسم المستخدم

source: Use your email or alphanumeric characters in a range from 3 to 50. First character must be a letter.
ar: استخدم بريدك الإلكتروني أو الأحرف الأبجدية الرقمية في نطاق من 3 إلى 50. يجب أن يكون الحرف الأول حرفًا.

source: Use alphanumeric characters and spaces in a range from 3 to 20. Cannot contain more than one space in a row.
ar: إلى 20. لا يمكن أن تحتوي على أكثر من مسافة واحدة في صف واحد.استخدم الأحرف الأبجدية الرقمية والمسافات في نطاق من 3

source: Sign up error.
ar: خطأ في التسجيل.

source: Save Login and Username for further sessions
ar: حفظ تسجيل الدخول واسم المستخدم لمزيد من الجلسات

source: New Chat
ar: دردشة جديدة

source: Add Occupants
ar: أضف شاغلين

source: Get users errors
ar: احصل على أخطاء المستخدمين

source: Error getting dialog from server
ar: خطأ في الحصول على مربع حوار من الخادم

source: Error getting users dialog from server
ar: خطأ في الحصول على مربع حوار المستخدمين من الخادم

source: Please, choose at least one participant
ar: من فضلك ، اختر مشارك واحد على الأقل

source: No user with that name
ar: لا يوجد مستخدم بهذا الاسم

source: Send message...
ar: إرسال رسالة ...

source: Failed to send a message
ar: فشل في إرسال الرسال

source: Load chat users errors
ar: تحميل أخطاء مستخدمي الدردشة

source: Attachment
ar: المرفق

source: You're all alone out here.
ar: أنت وحيد هنا.

source: Unsupported dialog type
ar: نوع الحوار غير مدعوم

source: Wait for all attachments to upload
ar: انتظر حتى يتم تحميل جميع المرفقات

source: Message Delivered to
ar: رسالة تسليمها ل

source: Message Viewed by
ar: تم عرض الرسالة بواسطة

source: no one
ar: لا احد

source: 1 member
ar: عضو واحد

source: members
ar: أفراد

source: Forward to
ar: الي

source: Public Group chat can be deleted only by owner
ar: يمكن حذف الدردشة الجماعية العامة من قبل المالك فقط

source: Application version:
ar: إصدار التطبيق:

source: is typing...
ar: ...يكتب

source: are typing...
ar: ...يكتبون

source: Chat Name
ar: اسم الدردشة

source: Must be in a range from 3 to 20 characters
ar: يجب أن يكون في نطاق من 3 إلى 20 حرفًا

source: Some parameter for Chat Settings is wrong. Please check the Chat Settings
ar: بعض معلمات إعدادات الدردشة خاطئة. يرجى التحقق من إعدادات الدردشة

source: Connection failed. Please check your internet connection.
ar: فشل الاتصال. الرجاء التحقق من اتصال الانترنت الخاص بك.

source: No response received within reply timeout
ar: لم يتم تلقي رد خلال مهلة الرد

source: Server connection timeout
ar: انتهت مهلة اتصال الخادم

source: The uploaded file exceeds maximum file size (100MB)
ar: يتجاوز حجم الملف الذي تم تحميله الحد الأقصى لحجم الملف (100 ميغا بايت)

source: Disconnected… Please check your Internet connection!
ar: غير متصل ... يرجى التحقق من اتصالك بالإنترنت!

source: Allow
ar: السماح

source: Touch takes you back to the call %1$s
ar: اللمس يعيدك إلى المكالمة %1$s

source: Error
ar: خطأ

source: You should allow Camera permission
ar: يجب أن تسمح لك إذن الكاميرا

source: You should allow Microphone permission
ar: يجب أن تسمح بإذن الميكروفون

source: Settings
ar: إعدادات

source: Pending
ar: قيد الانتظار

source: Closed
ar: مغلق

source: Incoming Audio Call
ar: مكالمة صوتية واردة

source: Incoming Video Call
ar: مكالمة فيديو واردة

source: Connect...
ar: الاتصال...

source: Checking...
ar: تدقيق...

source: Connected
ar: متصل

source: Disconnected
ar: انقطع الاتصال

source: Rejected
ar: مرفوض

source: No answer
ar: لا اجابة

source: Hung up
ar: اغلق الخط في وجهي

source: Video
ar: فيديو

source: Please enter country code
ar: الرجاء إدخال رمز الدولة

source: Please enter valid otp
ar: الرجاء إدخال otp صالح

source: Please enter name
ar: الرجاء إدخال الاسم

source: Please enter your date of birth
ar: الرجاء ادخال تاريخ ميلادك

source: Please choose option
ar: الرجاء اختيار الخيار

source: Allow access to your location
ar: السماح بالوصول إلى موقعك

source: Choose Allow all the time so you don't miss a single opportunity.
ar: اختر السماح طوال الوقت حتى لا تفوتك فرصة واحدة.

source: Save
ar: يحفظ

source: /mo
ar: /مو

source: Summery
ar: صيفي

source: Reporting
ar: الإبلاغ

source: Description
ar: وصف

source: You are now gold member.
ar: أنت الآن عضو ذهبي.

source: You are now premium member.
ar: أنت الآن عضو مميز.

source: Select country
ar: حدد الدولة

source: No matches
ar: لا يوجد تطابق

source: Best offer
ar: العرض الافضل

source: Save 50%
ar: وفر 50%

source: Save 70%
ar: وفر 70%

source: Change Language
ar: تغيير اللغة

source: Get Likes
ar: احصل على إعجابات

source: No likes yet?
ar: لا توجد اعجابات؟

source: No likes yet
ar: لا توجد اعجابات؟

source: Find your partner faster with premium membership
ar: اعثر على شريك حياتك اسرع فى الباقة المميزة

source: Language I speak
ar: اللغة التي أتحدثها

source: Week
ar: اسبوع

source: Month
ar: شهر

source: 3 months
ar: 3 شهور

source: 6 months
ar: 6 الشهور

source: $14.99/mo
ar: $14.99/شهر

source: $9.99/mo
ar: $9.99/شهر

source: Subscribe now
ar: اشترك الان

source: With premium membership you get marry faster.
ar: مع الباقة المميزة ستتزوج اسرع

source: The Best Islamic marriage app worldwide We have a lot of successful marriage stories and we wish you will be the next story
ar: افضل تطبيق زواج اسلامى فى جميع انحاء العالم نحن لدينا الكثير من قصص الزواج الناجحة ونتمنى تكون انت القصة التالية

source: Welcome
ar: اهلا بك

source: km
ar: كم

source: Unmatch
ar: عدم توافق

source: Korean
ar: الكورية

source: Russian
ar: الروسية

source: Japanese
ar: ليابانية

source: Irish
ar: إيرلندي

source: Italian
ar: إيطالي

source: Somali
ar: صومالي

source: Serbian
ar: الصربية

source: Chinese
ar: صينى

source: Latin
ar: لاتيني

source: Swedish
ar: السويدية

source: Amharic
ar: الأمهرية

source: Portuguese
ar: البرتغالية

source: It’s time to start swiping again.
ar: حان الوقت لبدء الضرب مرة أخرى.

source: Igbo
ar: الإيغبو

source: Kannada
ar: الكانادا

source: Telugu
ar: التيلجو

source: Gujarati
ar: الغوجاراتية

source: Thai
ar: التايلاندية

source: Khmer
ar: الخمير

source: Slovenian
ar: السلوفينية

source: Kazakh
ar: الكازاخستانية

source: Ukrainian
ar: الأوكرانية

source: Kurdish
ar: كردي

source: Romanian
ar: روماني

source: Successful Marriages Photos
ar: صور الزيجات الناجحة

source: New Messages
ar: رسائل جديدة

source: Arabic
ar: عربي

source: Welcome to halaldating 😊
ar: مرحبا بكم في halaldating 😊

source: You can see our successful stories
ar: يمكنك أن ترى قصصنا الناجحة

source: You are here to get married only 💍 so if you here for any other reason your account will be deactivated permanently.
ar: أنت هنا للزواج فقط 💍 لذلك إذا كنت هنا لأي سبب آخر ، فسيتم إلغاء تنشيط حسابك بشكل دائم.

source: Please be respectful to each other: We are here a family helping each other to get safe and happy Islamic marriage.
ar: يرجى احترام بعضكم البعض:نحن هنا عائلة نساعد بعضنا البعض في الحصول على زواج إسلامي آمن وسعيد.

source: Please read carefully safety tips for your safety: This will explain to you what are the steps of safe dating.
ar: يرجى قراءة إرشادات الأمان بعناية من أجل سلامتك: هذا سوف يشرح لك ما هي خطوات المواعدة الآمنة.

source: Please report users with bad attitude:there is report option on the top of chat and you can use it to report any user you are not comfortable with.
ar: الرجاء الابلاغ عن المستخدمين ذوي السلوك السيئ: يوجد خيار ابلاغ في الجزء العلوي من الدردشة ويمكنك استخدامه للإبلاغ عن أي مستخدم لا تشعر بالراحة معه.

source: You are here to get married only 💍 so if you here for any other reason your account will be deactivated permanently. Please be respectful to each other: We are here a family helping each other to get safe and happy Islamic marriage. Please read carefully safety tips for your safety: This will explain to you what are the steps of safe dating. Please report users with bad attitude: there is report option on the top of chat and you can use it to report any user you are not comfortable with.
ar: أنت هنا للزواج فقط 💍 لذلك إذا كنت هنا لأي سبب آخر ، فسيتم إلغاء تنشيط حسابك بشكل دائم. يرجى احترام بعضكم البعض: نحن هنا عائلة نساعد بعضنا البعض في الحصول على زواج إسلامي آمن وسعيد. يرجى قراءة إرشادات الأمان بعناية من أجل سلامتك: هذا سوف يشرح لك ما هي خطوات المواعدة الآمنة. الرجاء الابلاغ عن المستخدمين ذوي السلوك السيئ: يوجد خيار ابلاغ في الجزء العلوي من الدردشة ويمكنك استخدامه للإبلاغ عن أي مستخدم لا تشعر بالراحة معه.

source: Sorry! there are no profiles matching your search.
ar: آسف لا توجد ملفات شخصية مطابقة لبحثك

source: DD / MM / YYYY
ar: YYYY / MM / DD

source: Hello
ar: أهلا

source: OK
ar: نعم

source: Ok
ar: نعم

source: Choose Image
ar: اختر صورة

source: Camera
ar: آلة تصوير

source: Gallery
ar: صالة عرض

source: Online
ar: متصل

source: Expired
ar: منتهي الصلاحية

source: Your session has timed out.
ar: انقضت مهلة جلستك.

source: You got a new message
ar: لقد تلقيت رسالة جديدة

source: is calling you
ar: يتصل بك

source: Please select language
ar: الرجاء تحديد اللغة

source: We are reviewing your profile. Please wait to get approved.
ar: نحن نراجع ملفك الشخصي. يرجى الانتظار للحصول على الموافقة.

source: Okay
ar: تمام

source: Select Relationship Status
ar: حدد حالة العلاقة

source: Relationship Status
ar: الحالة الاجتماعية

source: Online Now
ar: متواجد حاليا

source: Visible
ar: مرئي

source: Anyone can see your profile
ar: يمكن لأي شخص رؤية ملف التعريف الخاص بك

source: Invisible
ar: غير مرئى

source: Your profile will not show on search. But you still able to like, match and chat
ar: ملفك الشخصي لن يظهر في البحث. لكنك لا تزال قادرًا على الإعجاب والمطابقة والدردشة.

source: no
ar: رقم

source: yes
ar: نعم

source: Profile status has been changed successfully
ar: تم تغيير حالة الملف الشخصي بنجاح

source: any
ar: أي

source: Any
ar: أي

source: No preference
ar: بدون تفضيل

source: Account deleted successfully.
ar: تم حذف الحساب بنجاح.
